{
  "intents": [
    {
      "tag": "boas_vindas",
      "patterns": [
        "Oi",
        "Olá",
        "Bom dia",
        "Boa tarde",
        "Sou calouro",
        "Acabei de entrar na UFERSA",
        "Estou começando agora",
        "E aí, tudo bem?"
      ],
      "responses": [
        "Olá! Seja muito bem-vindo(a) à Universidade Federal Rural do Semi-Árido (UFERSA)! Sou um assistente virtual e estou aqui para te ajudar com as principais dúvidas. Em que posso ser útil hoje?"
      ]
    },
    {
      "tag": "missao",
      "patterns": [
        "Qual é a missão da UFERSA?",
        "Qual o propósito da universidade?",
        "Missão da UFERSA",
        "Qual o objetivo da UFERSA?"
      ],
      "responses": [
        "A missão da UFERSA é produzir e difundir conhecimentos no campo da educação superior, com ênfase para a região semiárida brasileira, contribuindo para o exercício pleno da cidadania e preparando profissionais capazes de atender às demandas da sociedade."
      ]
    },
    {
      "tag": "campus",
      "patterns": [
        "Quais são os campus da UFERSA?",
        "A UFERSA só tem em Mossoró?",
        "Onde tem UFERSA?"
      ],
      "responses": [
        "A UFERSA possui quatro campus. O campus principal fica em Mossoró, e os outros estão nas cidades de Angicos, Caraúbas e Pau dos Ferros."
      ]
    },
    {
      "tag": "direitos_deveres",
      "patterns": [
        "Quais são meus direitos como aluno?",
        "Quais são meus deveres?",
        "O que eu posso e não posso fazer na faculdade?",
        "Regras da universidade"
      ],
      "responses": [
        "Como estudante, você tem direito à gratuidade no ensino de graduação e a participar de órgãos colegiados. Seus deveres incluem frequentar as aulas (mínimo de 75%), zelar pelo patrimônio da instituição e respeitar as normas da universidade."
      ]
    },
    {
      "tag": "sigaa",
      "patterns": [
        "O que é o SIGAA?",
        "Para que serve o SIGAA?",
        "Como acesso o SIGAA?",
        "Onde vejo minhas notas e faltas?"
      ],
      "responses": [
        "O SIGAA é o sistema acadêmico onde você pode acessar notas, emitir histórico e declaração de vínculo, realizar sua matrícula a cada semestre, acessar turmas virtuais e muito mais. O acesso é pelo link: https://sigaa.ufersa.edu.br/sigaa/verTelaLogin.do. As matrículas para calouros são automáticas no primeiro semestre."
      ]
    },
    {
      "tag": "matricula",
      "patterns": [
        "Como faço matrícula nas disciplinas?",
        "Quando me matriculo?",
        "Matrícula para veteranos",
        "Como funciona o ajuste de matrícula?"
      ],
      "responses": [
        "A matrícula dos alunos ingressantes é automática no primeiro semestre. A partir do segundo semestre, você deve realizar sua matrícula em disciplinas via SIGAA, durante o período definido no Calendário Acadêmico. Fique atento aos prazos no calendário para não perder!"
      ]
    },
    {
      "tag": "trancamento_matricula",
      "patterns": [
        "Como trancar o curso?",
        "Posso trancar a faculdade?",
        "Trancamento de matrícula institucional",
        "Preciso parar de estudar por um tempo"
      ],
      "responses": [
        "Sim, você pode solicitar o trancamento de matrícula institucional a partir do segundo período. O pedido é feito pelo SIGAA e pode ser concedido por um período máximo de 3 semestres, consecutivos ou não. O período de trancamento não conta para o tempo de integralização do curso."
      ]
    },
    {
      "tag": "cancelamento_vinculo",
      "patterns": [
        "Quero sair da UFERSA",
        "Como cancelar o curso?",
        "Não quero mais estudar na UFERSA",
        "Cancelar vínculo institucional"
      ],
      "responses": [
        "O cancelamento do vínculo pode ser realizado diretamente pelo SIGAA. O caminho é: Portal Discente > Ensino > Cancelamento de Vinculo Institucional. Mesmo após o cancelamento, você ainda terá acesso ao sistema para emitir seu histórico."
      ]
    },
    {
      "tag": "avaliacao",
      "patterns": [
        "Como funciona a avaliação?",
        "Como é calculada a média?",
        "Qual a média para passar?",
        "Sistema de notas"
      ],
      "responses": [
        "A avaliação é por disciplina e considera assiduidade (mínimo de 75% de frequência) e notas. São 3 avaliações parciais. Se a média aritmética delas for 7,0 ou superior, você está aprovado. Se a média for entre 3,5 e 6,9, você fará uma prova final. A média final para aprovação (com a prova final) deve ser no mínimo 5,0. Uma média parcial inferior a 3,5 resulta em reprovação automática."
      ]
    },
    {
      "tag": "frequencia_faltas",
      "patterns": [
        "Quantas faltas posso ter?",
        "Qual a frequência mínima?",
        "Fiquei doente e faltei, e agora?",
        "Atestado médico abona falta?"
      ],
      "responses": [
        "É obrigatório ter no mínimo 75% de frequência na carga horária de cada disciplina para não ser reprovado por falta. Atestados médicos com menos de 10 dias não abonam faltas, pois as ausências já estão previstas nos 25% que você pode faltar. Para afastamentos mais longos (a partir de 10 dias), você deve entregar o atestado na Divisão de Registro Escolar em até 3 dias úteis para ter direito a exercícios domiciliares."
      ]
    },
    {
      "tag": "biblioteca",
      "patterns": [
        "Como funciona a biblioteca?",
        "Como pegar um livro emprestado?",
        "Serviços da biblioteca",
        "O que é o SISBI?"
      ],
      "responses": [
        "A UFERSA possui um Sistema de Bibliotecas (SISBI) com unidades nos quatro campi. Elas oferecem empréstimo de livros, acesso a bases de dados, ficha catalográfica, normalização de trabalhos, entre outros serviços. A Biblioteca Orlando Teixeira, no Campus Central, atende a toda a comunidade."
      ]
    },
    {
      "tag": "assistencia_estudantil",
      "patterns": [
        "Preciso de ajuda financeira",
        "Tem bolsa auxílio?",
        "Como funciona o auxílio moradia?",
        "Quero saber sobre o Programa Permanência",
        "O que a PROAE faz?"
      ],
      "responses": [
        "A Pró-Reitoria de Assuntos Estudantis (PROAE) é responsável pela assistência ao estudante. Existe o Programa Institucional Permanência, que oferece auxílios (alimentação, transporte, moradia, etc.) para estudantes em vulnerabilidade socioeconômica. Os editais são divulgados no site da UFERSA a cada semestre."
      ]
    },
    {
      "tag": "restaurante_universitario",
      "patterns": [
        "Como funciona o RU?",
        "Qual o valor da refeição no RU?",
        "Quem pode comer no Restaurante Universitário?",
        "Almoço e jantar na faculdade"
      ],
      "responses": [
        "O Restaurante Universitário (RU) oferece almoço e jantar para toda a comunidade acadêmica. O custo da refeição para estudantes de graduação é parcialmente subsidiado pela UFERSA. Para ter acesso, você precisa fazer sua carteirinha de usuário na PROAE."
      ]
    },
    {
      "tag": "apoio_psicologico",
      "patterns": [
        "Tem psicólogo na UFERSA?",
        "Preciso de apoio emocional",
        "Como agendar atendimento com psicólogo?",
        "Serviço de psicologia"
      ],
      "responses": [
        "Sim, a UFERSA oferece um serviço de psicologia para acolher e ouvir os estudantes. Os atendimentos podem ser individuais ou em grupo e devem ser agendados previamente pelo site da PROAE ou do seu campus."
      ]
    },
    {
      "tag": "tcc",
      "patterns": [
        "Como funciona o TCC?",
        "O TCC é obrigatório?",
        "Quais os tipos de TCC?",
        "Trabalho de Conclusão de Curso"
      ],
      "responses": [
        "Sim, o Trabalho de Conclusão de Curso (TCC) é um componente obrigatório. Ele tem como objetivo proporcionar uma experiência de pesquisa ou extensão. O formato pode ser monografia, artigo científico, relatório de estágio ou memorial, dependendo das diretrizes do seu curso."
      ]
    },
    {
      "tag": "monitoria",
      "patterns": [
        "O que é monitoria?",
        "Como posso ser monitor?",
        "Monitoria tem bolsa?",
        "Quero ajudar os professores"
      ],
      "responses": [
        "O Programa de Monitoria visa melhorar o ensino e despertar o interesse do aluno pela docência. O monitor exerce 12 horas de atividades semanais e pode receber uma bolsa auxílio. Você pode encontrar mais informações no site da PROGRAD ou com o professor da disciplina."
      ]
    },
    {
      "tag": "iniciacao_cientifica",
      "patterns": [
        "O que é iniciação científica?",
        "Como participar de um projeto de pesquisa?",
        "O que é PIBIC?",
        "Quero ser pesquisador"
      ],
      "responses": [
        "O Programa Institucional de Bolsas de Iniciação Científica (PIBIC/PICI) permite que você aprenda técnicas e métodos de pesquisa, orientado por um pesquisador qualificado. Isso estimula o pensamento científico e a criatividade. Fique de olho nos editais lançados pela PROPPG."
      ]
    },
    {
      "tag": "estagio",
      "patterns": [
        "Como funciona o estágio?",
        "Estágio é obrigatório?",
        "Qual a diferença de estágio obrigatório e não obrigatório?",
        "Onde encontro vagas de estágio?"
      ],
      "responses": [
        "O estágio é uma atividade acadêmica no ambiente de trabalho. Ele pode ser **Obrigatório**, quando é um componente curricular indispensável para se formar, ou **Não Obrigatório**, uma atividade opcional que conta como horas complementares. No estágio não obrigatório, a empresa deve conceder bolsa-auxílio e auxílio transporte."
      ]
    },
    {
      "tag": "ouvidoria",
      "patterns": [
        "O que é a Ouvidoria?",
        "Quando devo procurar a Ouvidoria?",
        "Quero fazer uma reclamação",
        "Quero fazer um elogio"
      ],
      "responses": [
        "A Ouvidoria é um canal de comunicação entre você e a gestão da UFERSA. Você deve procurá-la após já ter tentado resolver a questão no setor responsável sem sucesso, ou se tiver ciência de alguma irregularidade. Ela também serve para enviar elogios. O atendimento é sigiloso."
      ]
    },
    {
      "tag": "contato",
      "patterns": [
        "Contato da UFERSA",
        "Telefone da secretaria",
        "Falar com a coordenação do curso",
        "Qual o e-mail da universidade?"
      ],
      "responses": [
        "Os contatos das coordenações de curso geralmente ficam localizadas nos prédios dos centros acadêmicos. Para contatos gerais, o melhor é consultar o site oficial: www.ufersa.edu.br."
      ]
    },
    {
      "tag": "agradecimento",
      "patterns": [
        "Obrigado",
        "Valeu",
        "Ajudou muito",
        "Obrigada pela ajuda"
      ],
      "responses": [
        "De nada! Se precisar de mais alguma coisa, é só perguntar. Bons estudos!"
      ]
    },
    {
      "tag": "fallback",
      "patterns": [],
      "responses": [
        "Desculpe, não entendi sua pergunta. Você pode tentar perguntar de outra forma. Por exemplo: 'Como funciona a avaliação?' ou 'Quais auxílios para estudantes existem?'.",
        "Hmmm... não tenho certeza se entendi. Poderia reformular? Estou aqui para ajudar com dúvidas sobre matrícula, bolsas, RU, TCC, biblioteca e outros assuntos da vida acadêmica na UFERSA."
      ]
    }
  ]
}